src/Catalogs/ЭлементыДиалогов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>ЭлементыДиалогов</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.ШаблоныДиалогов</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТипЭлементаДиалога</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыЭлементовДиалогов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СледующийЭлемент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШаблоныДиалогов</v8:Type>
						<v8:Type>cfg:CatalogRef.ЭлементыДиалогов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Форма</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФормыДиалогов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Действие</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДействияЭлементовДиалогов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПараметрДействия</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:EnumRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормаГостя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФормыДиалогов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПараметрыФормы</Name>
					<Comment>Для подстановки в отображаемую форму</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяПараметра</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеПараметра</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ВариантыОтветов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВариантОтвета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЭлементыДиалогов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстКнопки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПараметрыФормыГостя</Name>
					<Comment>Для подстановки в отображаемую форму</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяПараметра</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеПараметра</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/ФормыДиалогов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>ФормыДиалогов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Форма</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТелоСообщения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранилищеТела</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/ЭлементыДиалогов/Forms/ФормаЭлемента/Ext/Form/Module.bsl
Процедура ВидимостьЭлементов()
	Элементы.ПараметрДействия.Видимость = Ложь;	
	Элементы.Действие.Видимость = Ложь;	
	Элементы.СтраницаВарианты.Видимость = Ложь;	
	Элементы.Формы.Видимость = Ложь;	
	Если Объект.ТипЭлементаДиалога = Справочники.ТипыЭлементовДиалогов.Действие Тогда
		Элементы.Действие.Видимость = Истина;	
		Если Объект.Действие = Справочники.ДействияЭлементовДиалогов.ДобавитьТоварВЗаказ Тогда
			Элементы.ПараметрДействия.Заголовок = "Товар";
			Элементы.ПараметрДействия.ВыбиратьТип = Ложь;
			Объект.ПараметрДействия = ?(ТипЗнч(Объект.ПараметрДействия) = Тип("СправочникСсылка.Товары"), Объект.ПараметрДействия, ПредопределенноеЗначение("Справочник.Товары.ПустаяСсылка"));
			Элементы.ПараметрДействия.Видимость = Истина;	
		КонецЕсли;	
	ИначеЕсли Объект.ТипЭлементаДиалога = Справочники.ТипыЭлементовДиалогов.Вопрос Тогда
		Элементы.СтраницаВарианты.Видимость = Истина;	
		Элементы.Формы.Видимость = ИСтина;	
	Иначе
		Элементы.Основные.Видимость = Истина;	
	КонецЕсли;
	
	Если Не (Объект.Форма.Пустая() И Объект.ФормаГостя.Пустая()) Тогда
	
		Элементы.Формы.Видимость = Истина;	
	
	КонецЕсли; 
КонецПроцедуры


&НаКлиенте
Процедура ТипЭлементаДиалогаПриИзменении(Элемент)
	ВидимостьЭлементов()
КонецПроцедуры


&НаКлиенте
Процедура ДействиеПриИзменении(Элемент)
	ВидимостьЭлементов()
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ВидимостьЭлементов()
КонецПроцедуры


&НаКлиенте
Процедура ВариантыОтветовПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Если Объект.ВариантыОтветов.Количество() >= 3 Тогда
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ФормаПриИзменении(Элемент)
	ВидимостьЭлементов();
КонецПроцедуры


&НаКлиенте
Процедура ФормаГостяПриИзменении(Элемент)
	ВидимостьЭлементов();
КонецПроцедуры


&НаСервере
Процедура ЗаполнитьПараметрыФормыНаСервере()
	Объект.ПараметрыФормы.Очистить();
	
	ДобавитьПараметрыФормы(Объект.Форма, Объект.ПараметрыФормы);	
КонецПроцедуры

Процедура ЗаполнитьПараметрыФормыГостяНаСервере()
	Объект.ПараметрыФормыГостя.Очистить();
	
	ДобавитьПараметрыФормы(Объект.ФормаГостя,Объект.ПараметрыФормыГостя);	
КонецПроцедуры


Процедура ДобавитьПараметрыФормы(ФормаСсылка, ТЧ)
	Если ФормаСсылка.Пустая() Тогда
	
		Возврат;
	
	КонецЕсли; 
	ФД = ФормаСсылка.ХранилищеТела.Получить();
	HTML = HTML;
	Вложения=Вложения;
	ФД.ПолучитьHTML(HTML, Вложения);
	HTML_ФормДок = СтрЗаменить(HTML,"padding:8px;","padding:0px;");
	
	RegExp = Новый COMОбъект("VBScript.RegExp");
	RegExp.Pattern="%([\wА-я]*)%";
	RegExp.IgnoreCase = 1;
	m=RegExp.Execute(HTML_ФормДок);
	Для каждого т из m цикл
		Если Т.SubMatches.count Тогда
			Пар =ТЧ.Добавить();
			Пар.ИмяПараметра = Т.SubMatches.Item(0);
		КонецЕсли;
	КонецЦикла;

	
КонецПроцедуры 


&НаКлиенте
Процедура ЗаполнитьПараметрыФормы(Команда)
	Если Объект.ПараметрыФормы.Количество() Тогда
		Для каждого Т Из Объект.ПараметрыФормы Цикл
			Если ЗначениеЗаполнено(Т.ЗначениеПараметра) Тогда
				Если Вопрос("Параметры будут очищены. Продолжить?",РежимДиалогаВопрос.ДаНет)=КодВозвратаДиалога.Нет Тогда
					Возврат;
				Иначе
					Прервать;
				КонецЕсли; 
			КонецЕсли; 	
		КонецЦикла; 
	КонецЕсли; 
	ЗаполнитьПараметрыФормыНаСервере();
КонецПроцедуры
	
&НаКлиенте
Процедура ПроверитьФорму(Команда)
	
	
	П = Новый Структура("Ключ, ЭлементДиалога", Объект.Форма, Объект.Ссылка);
	
	ОткрытьФорму("Справочник.ФормыДиалогов.Форма." + Объект.Форма, П, ЭтаФорма, , ВариантОткрытияОкна.ОтдельноеОкно);
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьФормуГостя(Команда)
	
	П = Новый Структура("Ключ, ЭлементДиалога", Объект.ФормаГостя, Объект.Ссылка);
	
	ОткрытьФорму("Справочник.ФормыДиалогов.Форма." + Объект.ФормаГостя, П, ЭтаФорма,, ВариантОткрытияОкна.ОтдельноеОкно);
	
	

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПараметрыФормыГостя(Команда)
	Если Объект.ПараметрыФормыГостя.Количество() Тогда
		Для каждого Т Из Объект.ПараметрыФормыГостя Цикл
			Если ЗначениеЗаполнено(Т.ЗначениеПараметра) Тогда
				Если Вопрос("Параметры будут очищены. Продолжить?",РежимДиалогаВопрос.ДаНет)=КодВозвратаДиалога.Нет Тогда
					Возврат;
				Иначе
					Прервать;
				КонецЕсли; 
			КонецЕсли; 	
		КонецЦикла; 
	КонецЕсли; 
	ЗаполнитьПараметрыФормыГостяНаСервере();
КонецПроцедуры
